TexasInstruments/motor-control-sdk/examples/tidep_01032_dual_motor_drive/universal_single_chip_servo/am243x-lp-BP-AM2BLDCSERVO/r5fss0-0_nortos/AM243_BP-AM2BLDCSERVO.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --part "ALX" --package "ALX" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@10.02.00"
 * @v2CliArgs --device "AM2434" --package "FCCSP (ALX)" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@10.02.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const sdfm            = scripting.addModule("/current_sense/sdfm", {}, false);
const sdfm1           = sdfm.addInstance();
const epwm            = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1           = epwm.addInstance();
const epwm2           = epwm.addInstance();
const epwm3           = epwm.addInstance();
const epwm4           = epwm.addInstance();
const epwm5           = epwm.addInstance();
const epwm6           = epwm.addInstance();
const epwm7           = epwm.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const gpio3           = gpio.addInstance();
const gpio4           = gpio.addInstance();
const pruicss         = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1        = pruicss.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const timer           = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1          = timer.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const section13       = section.addInstance();
const section14       = section.addInstance();
const section15       = section.addInstance();
const endat           = scripting.addModule("/position_sense/endat", {}, false);
const endat1          = endat.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
sdfm1.$name                        = "CONFIG_SDFM0";
sdfm1.SDFM_CLK_GEN                 = "3";
sdfm1.G_MUX_EN                     = true;
sdfm1.Enable_Channel_0             = true;
sdfm1.Enable_Channel_1             = true;
sdfm1.Enable_Channel_2             = true;
sdfm1.Ch0_EPWM_SYNC                = true;
sdfm1.Ch1_EPWM_SYNC                = true;
sdfm1.Ch2_EPWM_SYNC                = true;
sdfm1.Ch0_NC_OSR                   = 16;
sdfm1.Ch1_NC_OSR                   = 16;
sdfm1.Ch2_NC_OSR                   = 16;
sdfm1.Enable_Load_Share            = true;
sdfm1.Enable_Channel_3             = true;
sdfm1.Enable_Channel_4             = true;
sdfm1.Enable_Channel_5             = true;
sdfm1.Ch3_NC_OSR                   = 16;
sdfm1.Ch4_NC_OSR                   = 16;
sdfm1.Ch5_NC_OSR                   = 16;
sdfm1.PRU_ICSSG0_PRU.$assign       = "PRU_ICSSG0_PRU0";
sdfm1.PRU_ICSSG0_PRU.GPI16.$assign = "PRG0_PRU0_GPO16";
sdfm1.PRU_ICSSG0_PRU.GPO1.$used    = false;
sdfm1.PRU_ICSSG0_PRU.GPI19.$used   = false;
sdfm1.PRU_ICSSG0_PRU.GPI1.$assign  = "PRG0_PRU0_GPO1";
sdfm1.PRU_ICSSG0_PRU.GPI3.$assign  = "PRG0_PRU0_GPO3";

epwm1.$name            = "EPWM0_AXIS1";
epwm1.EPWM.$assign     = "EHRPWM2";
epwm1.EPWM.SYNCO.$used = false;
epwm1.EPWM.SYNCI.$used = false;

epwm2.$name            = "EPWM1_AXIS1";
epwm2.EPWM.$assign     = "EHRPWM1";
epwm2.EPWM.SYNCO.$used = false;
epwm2.EPWM.SYNCI.$used = false;

epwm3.$name            = "EPWM2_AXIS1";
epwm3.EPWM.$assign     = "EHRPWM0";
epwm3.EPWM.SYNCO.$used = false;
epwm3.EPWM.SYNCI.$used = false;

epwm4.$name            = "EPWM0_AXIS2";
epwm4.EPWM.$assign     = "EHRPWM5";
epwm4.EPWM.A.$assign   = "GPMC0_BE1n";
epwm4.EPWM.B.$used     = false;
epwm4.EPWM.SYNCO.$used = false;
epwm4.EPWM.SYNCI.$used = false;

epwm5.$name            = "EPWM1_AXIS2";
epwm5.EPWM.$assign     = "EHRPWM7";
epwm5.EPWM.A.$assign   = "PRG0_PRU1_GPO18";
epwm5.EPWM.B.$assign   = "PRG0_PRU1_GPO19";
epwm5.EPWM.SYNCO.$used = false;
epwm5.EPWM.SYNCI.$used = false;

epwm6.$name            = "EPWM2_AXIS2";
epwm6.EPWM.$assign     = "EHRPWM8";
epwm6.EPWM.A.$assign   = "GPMC0_AD7";
epwm6.EPWM.B.$assign   = "GPMC0_AD10";
epwm6.EPWM.SYNCO.$used = false;
epwm6.EPWM.SYNCI.$used = false;

epwm7.$name            = "EPWM0_B_AXIS2";
epwm7.EPWM.$assign     = "EHRPWM3";
epwm7.EPWM.A.$used     = false;
epwm7.EPWM.B.$assign   = "GPMC0_AD14";
epwm7.EPWM.SYNCO.$used = false;
epwm7.EPWM.SYNCI.$used = false;

gpio1.$name          = "BP_MUX_SEL";
gpio1.pinDir         = "OUTPUT";
gpio1.defaultValue   = "1";
gpio1.GPIO_n.$assign = "GPMC0_AD11";

gpio2.rx             = true;
gpio2.pinDir         = "OUTPUT";
gpio2.$name          = "CONFIG_AXIS1_GATE_EN_GPIO";
gpio2.GPIO_n.$assign = "I2C0_SCL";

gpio3.$name          = "CONFIG_LED1C";
gpio3.pinDir         = "OUTPUT";
gpio3.GPIO_n.$assign = "ADC0_AIN4";

gpio4.$name          = "CONFIG_AXIS2_GATE_EN_GPIO";
gpio4.pinDir         = "OUTPUT";
gpio4.GPIO_n.$assign = "I2C0_SDA";

debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART1";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
debug_log.uartLog.child = uart_v0_template1;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

