TexasInstruments/motor-control-sdk/examples/tidep_01032_dual_motor_drive/universal_single_chip_servo/am243x-lp-BP-AM2BLDCSERVO/r5fss0-0_nortos/AM243_BP-AM2BLDCSERVO.syscfg
section6.$name                                    = "Stack Segments";
section6.load_memory                              = "MSRAM";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.$name                        = "Initialization and Exception Handling";
section7.load_memory                  = "MSRAM";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

section8.$name                       = "User Shared Memory";
section8.type                        = "NOLOAD";
section8.load_memory                 = "USER_SHM_MEM";
section8.group                       = false;
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.user_shared_mem";
section8.output_section[0].alignment = 0;

section9.$name                       = "Log Shared Memory";
section9.load_memory                 = "LOG_SHM_MEM";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "IPC Shared Memory";
section10.type                        = "NOLOAD";
section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "Non Cacheable Memory";
section11.load_memory                 = "NON_CACHE_MEM";
section11.group                       = false;
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.nocache";
section11.output_section[0].alignment = 0;

section12.$name                   = "UMC_TCMA";
section12.load_memory             = "R5F_TCMA";
section12.output_section.create(1);
section12.output_section[0].$name = ".tcm_code";

section13.$name                       = "UMC_TCMB";
section13.load_memory                 = "R5F_TCMB0";
section13.output_section.create(9);
section13.output_section[0].$name     = ".tcm_data";
section13.output_section[1].$name     = "hal_data";
section13.output_section[2].$name     = "user_data";
section13.output_section[3].$name     = "foc_data";
section13.output_section[4].$name     = "motor_data";
section13.output_section[5].$name     = "sys_data";
section13.output_section[6].$name     = ".sfradata";
section13.output_section[7].$name     = ".gSddfChSampsRaw";
section13.output_section[7].alignment = 4;
section13.output_section[8].$name     = ".gEnDatChInfo";
section13.output_section[8].alignment = 4;

section14.$name                   = "UMC_OCRAM";
section14.load_memory             = "MSRAM";
section14.output_section.create(2);
section14.output_section[0].$name = ".trigData";
section14.output_section[1].$name = ".datalog_data";

section15.$name                        = "No Cache Memory ";
section15.group                        = false;
section15.load_memory                  = "MSRAM_NO_CACHE";
section15.type                         = "NOLOAD";
section15.output_section.create(1);
section15.output_section[0].$name      = ".gEtherCatCia402";
section15.output_section[0].alignment  = 4;
section15.output_section[0].palignment = true;

endat1.$name                    = "CONFIG_ENDAT0";
endat1.G_MUX_EN                 = true;
endat1.Booster_Pack             = true;
endat1.Multi_Channel_Load_Share = true;
endat1.Channel_2                = true;
endat1.ENC1_EN.$name            = "ENC1_EN";
endat1.ENC1_EN.GPIO_n.$assign   = "MMC1_SDWP";
endat1.ENC2_EN.$name            = "ENC2_EN";
endat1.ENC2_EN.GPIO_n.$assign   = "MMC1_SDCD";
endat1.PRU_ICSSG0_PRU.$assign   = "PRU_ICSSG0_PRU1";

pruicss1.$name                                                                    = "CONFIG_PRU_ICSS0";
endat1.pru                                                                        = pruicss1;
sdfm1.pru                                                                         = pruicss1;
pruicss1.iepClk                                                                   = 300000000;
pruicss1.AdditionalICSSSettings[0].$name                                          = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruIepIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].$name                              = "CONFIG_PRU_ICSS_IEP_IO0";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.$assign             = "PRU_ICSSG0_IEP0";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT0.$used = true;
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT1.$used = true;
pruicss1.intcMapping.create(2);
pruicss1.intcMapping[0].$name                                                     = "CONFIG_ICSS0_INTC_MAPPING2";
pruicss1.intcMapping[0].channel                                                   = "5";
pruicss1.intcMapping[0].event                                                     = "24";
pruicss1.intcMapping[1].$name                                                     = "CONFIG_ICSS0_INTC_MAPPING0";
pruicss1.intcMapping[1].event                                                     = "21";
pruicss1.intcMapping[1].channel                                                   = "6";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
sdfm1.PRU_ICSSG0_PRU.GPI5.$suggestSolution                                                   = "PRG0_PRU0_GPO5";
sdfm1.PRU_ICSSG0_PRU.GPI7.$suggestSolution                                                   = "PRG0_PRU0_GPO7";
sdfm1.PRU_ICSSG0_PRU.GPI18.$suggestSolution                                                  = "PRG0_PRU0_GPO18";
sdfm1.PRU_ICSSG0_PRU.GPI11.$suggestSolution                                                  = "PRG0_PRU0_GPO11";
epwm1.EPWM.A.$suggestSolution                                                                = "GPMC0_AD8";
epwm1.EPWM.B.$suggestSolution                                                                = "GPMC0_AD9";
epwm2.EPWM.A.$suggestSolution                                                                = "GPMC0_AD5";
epwm2.EPWM.B.$suggestSolution                                                                = "GPMC0_AD6";
epwm3.EPWM.A.$suggestSolution                                                                = "GPMC0_AD3";
epwm3.EPWM.B.$suggestSolution                                                                = "GPMC0_AD4";
debug_log.uartLog.UART.RXD.$suggestSolution                                                  = "UART1_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                                                  = "UART1_TXD";
endat1.PRU_ICSSG0_PRU.GPO2.$suggestSolution                                                  = "PRG0_PRU1_GPO2";
endat1.PRU_ICSSG0_PRU.GPO1.$suggestSolution                                                  = "PRG0_PRU1_GPO1";
endat1.PRU_ICSSG0_PRU.GPO0.$suggestSolution                                                  = "PRG0_PRU1_GPO0";
endat1.PRU_ICSSG0_PRU.GPI13.$suggestSolution                                                 = "PRG0_PRU1_GPO13";
endat1.PRU_ICSSG0_PRU.GPO8.$suggestSolution                                                  = "PRG0_PRU1_GPO8";
endat1.PRU_ICSSG0_PRU.GPO12.$suggestSolution                                                 = "PRG0_PRU1_GPO12";
endat1.PRU_ICSSG0_PRU.GPO6.$suggestSolution                                                  = "PRG0_PRU1_GPO6";
endat1.PRU_ICSSG0_PRU.GPI11.$suggestSolution                                                 = "PRG0_PRU1_GPO11";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT0.$suggestSolution = "PRG0_PRU0_GPO19";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT1.$suggestSolution = "PRG0_PRU0_GPO17";
